In [ ]:
import sqlite3


def create_table():
    conn = sqlite3.connect('myclass.db')
    conn.execute('''CREATE TABLE IF NOT EXISTS students
                    (id INTEGER PRIMARY KEY AUTOINCREMENT,
                    first_name TEXT NOT NULL,
                    last_name TEXT NOT NULL,
                    roll_number INTEGER NOT NULL,
                    address TEXT NOT NULL);''')
    conn.close()


def add_student(first_name, last_name, roll_number, address):
    conn = sqlite3.connect('myclass.db')
    conn.execute('''INSERT INTO students (first_name, last_name, roll_number, address)
                    VALUES (?, ?, ?, ?);''', (first_name, last_name, roll_number, address))
    conn.commit()
    conn.close()


def display_students():
    conn = sqlite3.connect('myclass.db')
    students = conn.execute("SELECT * FROM students;").fetchall()
    for student in students:
        print(student)
    conn.close()


create_table()
add_student("Ojas", "Kambli", 39, "Malad")
add_student("Stan", "Nadar", 49, "Vasai")
add_student("Harsh", "Kale", 38, "Kandivali")
display_students()

(1, 'Ojas', 'Kambli', 39, 'Malad')
(2, 'Stan', 'Nadar', 49, 'Vasai')
(3, 'Harsh', 'Kale', 38, 'Kandivali')
(4, 'Ojas', 'Kambli', 39, 'Malad')
(5, 'Stan', 'Nadar', 49, 'Vasai')
(6, 'Harsh', 'Kale', 38, 'Kandivali')

In [ ]:
import sqlite3


class MyClassDatabase:
    def __init__(self):
        self.conn = sqlite3.connect('myclass.db')
        self.create_table()

    def __del__(self):
        self.conn.close()

    def create_table(self):
        self.conn.execute('''CREATE TABLE IF NOT EXISTS students
                        (id INTEGER PRIMARY KEY AUTOINCREMENT,
                        first_name TEXT NOT NULL,
                        last_name TEXT NOT NULL,
                        roll_number INTEGER NOT NULL,
                        address TEXT NOT NULL);''')

    def add_student(self, first_name, last_name, roll_number, address):
        self.conn.execute('''INSERT INTO students (first_name, last_name, roll_number, address)
                        VALUES (?, ?, ?, ?);''', (first_name, last_name, roll_number, address))
        self.conn.commit()

    def display_students(self):
        students = self.conn.execute("SELECT * FROM students;").fetchall()
        for student in students:
            print(student)


my_db = MyClassDatabase()
my_db.add_student("Ojas", "Kambli", 39, "Malad")
my_db.add_student("Stan", "Nadar", 49, "Vasai")
my_db.add_student("Harsh", "Kale", 38, "Mira Road")
my_db.display_students()

(1, 'Ojas', 'Kambli', 39, 'Malad')
(2, 'Stan', 'Nadar', 49, 'Vasai')
(3, 'Harsh', 'Kale', 38, 'Kandivali')
(4, 'Ojas', 'Kambli', 39, 'Malad')
(5, 'Stan', 'Nadar', 49, 'Vasai')
(6, 'Harsh', 'Kale', 38, 'Kandivali')
(7, 'Ojas', 'Kambli', 39, 'Malad')
(8, 'Stan', 'Nadar', 49, 'Vasai')
(9, 'Harsh', 'Kale', 38, 'Mira Road')

In [ ]:
import sqlite3


def create_database(database_name):
    conn = sqlite3.connect(database_name)
    conn.close()


def create_table(database_name, table_name):
    conn = sqlite3.connect(database_name)
    conn.execute(f'''CREATE TABLE IF NOT EXISTS {table_name}
                    (id INTEGER PRIMARY KEY AUTOINCREMENT,
                    first_name TEXT NOT NULL,
                    last_name TEXT NOT NULL,
                    roll_number INTEGER NOT NULL,
                    address TEXT NOT NULL);''')
    conn.close()


def add_student(database_name, table_name, first_name, last_name, roll_number, address):
    conn = sqlite3.connect(database_name)
    conn.execute(f'''INSERT INTO {table_name} (first_name, last_name, roll_number, address)
                    VALUES (?, ?, ?, ?);''', (first_name, last_name, roll_number, address))
    conn.commit()
    conn.close()


def display_students(database_name, table_name):
    conn = sqlite3.connect(database_name)
    students = conn.execute(f"SELECT * FROM {table_name};").fetchall()
    for student in students:
        print(student)
    conn.close()


def main():
    database_name = 'myclass.db'
    table_name = 'students'
    create_database(database_name)
    create_table(database_name, table_name)
    add_student(database_name, table_name, "Ojas", "Kambli", 39, "Malad")
    add_student(database_name, table_name, "Manav", "Ghadi", 49, "Vasai")
    add_student(database_name, table_name, "Harsh", "Kale", 38, "Mira Road")
    display_students(database_name, table_name)


if __name__ == '__main__':
    main()

(1, 'Ojas', 'Kambli', 39, 'Malad')
(2, 'Stan', 'Nadar', 49, 'Vasai')
(3, 'Harsh', 'Kale', 38, 'Kandivali')
(4, 'Ojas', 'Kambli', 39, 'Malad')
(5, 'Stan', 'Nadar', 49, 'Vasai')
(6, 'Harsh', 'Kale', 38, 'Kandivali')
(7, 'Ojas', 'Kambli', 39, 'Malad')
(8, 'Stan', 'Nadar', 49, 'Vasai')
(9, 'Harsh', 'Kale', 38, 'Mira Road')
(10, 'Ojas', 'Kambli', 39, 'Malad')
(11, 'Manav', 'Ghadi', 49, 'Vasai')
(12, 'Harsh', 'Kale', 38, 'Mira Road')